[
    {
		"web": true,
		"link": "https://fit-tracker.fly.dev/",
		"git": "https://github.com/nacho-alex/project-module-3",
		"images": ["/images/web1_fit/web1_01.png", "/images/web1_fit/web1_02.png", "/images/web1_fit/web1_03.png", "/images/web1_fit/web1_04.png","/images/web1_fit/web1_05.png", "/images/web1_fit/web1_06.png","/images/web1_fit/web1_07.png","/images/web1_fit/web1_08.png","/images/web1_fit/web1_09.png", "/images/web1_fit/web1_10.png", "/images/web1_fit/web1_11.png", "/images/web1_fit/web1_12.png", "/images/web1_fit/web1_13.png", "/images/web1_fit/web1_14.png", "/images/web1_fit/web1_15.png", "/images/web1_fit/web1_16.png"],
		"title": "Fit-Tracker - Seguimiento deportivo",
		"description": "Aplicaci贸n integral de seguimiento de fitness que permite a los usuarios gestionar rutinas de ejercicio, monitorear su alimentaci贸n y visualizar su progreso a trav茅s de gr谩ficos intuitivos.",
		"caracteristicas": [
			{
				"name": "Seguimiento", 
				"lines": [
					"Registro de usuario con datos personales para c谩lculo autom谩tico de necesidades nutricionales",
					"Calendario interactivo con historial de actividades y alimentaci贸n"
				]
			},
			{
				"name": "Ejercicio", 
				"lines": [
					"Biblioteca de rutinas predefinidas seleccionables",
					"Registro de actividad f铆sica diaria",
					"Seguimiento de progreso mediante gr谩ficas",
					"Personalizaci贸n de rutinas seg煤n perfil de usuario"
				]
			},
			{
				"name": "Nutrici贸n", 
				"lines": [
					"Registro de comidas y creaci贸n de biblioteca personal de alimentos",
					"C谩lculo autom谩tico del balance de calor铆as diarias",
					"Seguimiento de macronutrientes (prote铆nas, carbohidratos, grasas)"
				]
			}
		],
	"tags": ["JavaScript", "React", "Node.js", "MongoDB", "Docker", "HTML & CSS"] 
    },
	{
		"web": true,
		"link": "https://project-module2.fly.dev/",
		"git": "https://github.com/nacho-alex/project-module2",
		"images": ["/images/web2_reel/web2_01.png", "/images/web2_reel/web2_02.png", "/images/web2_reel/web2_03.png", "/images/web2_reel/web2_04.png", "/images/web2_reel/web2_05.png", "/images/web2_reel/web2_06.png", "/images/web2_reel/web2_07.png", "/images/web2_reel/web2_08.png", "/images/web2_reel/web2_09.png", "/images/web2_reel/web2_10.png"],
		"title": "Reelations - Red social de cine",
		"description": "Reelations es una red social dedicada a los amantes del cine que permite descubrir, catalogar y compartir experiencias cinematogr谩ficas. Ofrece herramientas para organizar pel铆culas vistas o pendientes, interactuar con otros usuarios etc...  ",
		"caracteristicas": [
			{
				"name": "Descubrimiento Cinematogr谩fico",
				"lines": [
				"Sistema de recomendaci贸n inteligente que sugiere pel铆culas aleatorias seg煤n preferencias y filtros aplicados por el usuario.",
				"Cat谩logo completo filtrable por m煤ltiples criterios: g茅nero, a帽o de lanzamiento, valoraci贸n de cr铆ticos y usuarios, duraci贸n, etc."
				]
			},
			{
				"name": "Organizaci贸n Personal",
				"lines": [
				"Creaci贸n de listas personalizadas (pel铆culas vistas, favoritas, pendientes) con posibilidad de compartirlas con otros usuarios."
				]
			},
			{
				"name": "Interacci贸n Social",
				"lines": [
				"Fichas detalladas de cada pel铆cula con informaci贸n t茅cnica, reparto, sinopsis y material promocional.",
				"Secci贸n de comentarios y valoraciones para compartir opiniones y generar debate con otros aficionados del cine."
				]
			}
		],
		"tags": ["JavaScript", "Node.js", "Handlebars", "HTML & CSS"]
	},
	{
	"link": "",
		"git": "https://github.com/Nachopuerto95/Restaurants_WEB",
		"web": true,
		"images": ["/images/web3_rest/web3_01.png", "/images/web3_rest/web3_02.png", "/images/web3_rest/web3_03.png", "/images/web3_rest/web3_04.png"],
		"title": "Beet it - Aplicaci贸n de restaurantes",
		"description": "Es una p谩gina para buscar restaurantes por zona, puedes activar ubicaci贸n o escribir la que prefieras para ver la oferta de restaurantes, filtrar por categor铆a precio etc...",
		"caracteristicas": [
			{
				"name": " EN DESARROLLO "
			}
		],
		"tags": ["JavaScript", "React", "Node.js", "HTML & CSS", "Google APIs"]
	},
	{
		"link": "https://adventure-forest-nachopuerto.netlify.app/",
		"git": "https://github.com/Nachopuerto95/JUEGO-IRONHACK",
		"web": true,
		"images": ["/images/web4_game/web4_01.png", "/images/web4_game/web4_02.png", "/images/web4_game/web4_03.png", "/images/web4_game/web4_04.png", "/images/web4_game/web4_05.png", "/images/web4_game/web4_06.png", "/images/web4_game/web4_07.png"],
		"title": "Adventure forest - Endless runner game",
		"description": "Es un juego basado en el Dinosaurio de chrome pero con algunas mec谩nicas que lo hacen bastante adictivo, es s铆mple y din谩mico y su dificultad va en aumento",
		"caracteristicas": [
			{
				"name": "Caracter铆sticas",
				"lines": [
				"Se autogeneran enemigos y obst谩culos, hay un tiempo l铆mite que se puede aumentar atrapando las frutas, a su vez todo el juego se acelera conforme avanza el jugador",
				"Tiene una interfaz, con instrucciones y tabla de puntuaciones local (utiliza LocalStorage)",
				"Sprites retro de el juego Adventure island 3 de SNES"
				]
			}
		],
		"tags": ["JavaScript", "POO", "HTML & CSS"]
	},
	{
		"git": "https://github.com/jpuerto-loruzqui/Cub3D",
		"images": ["/images/low1_cub/low1_00.png","/images/low1_cub/low1_02.gif", "/images/low1_cub/low1_01.gif", "/images/low1_cub/low1_03.gif", "/images/low1_cub/low1_04.gif", "/images/low1_cub/low1_05.png"],
		"title": "Cub3d - Algoritmo ray-casting en C",
		"description": "Cub3D es un proyecto de gr谩ficos 3D donde se desarrolla un motor gr谩fico basado en algoritmo de raycasting, inspirado en el cl谩sico Wolfenstein 3D. El objetivo es crear un laberinto tridimensional navegable en primera persona con texturas, iluminaci贸n din谩mica y control completo del personaje.",
		"caracteristicas": [
			{
				"name": "Motor de Raycasting",
				"lines": [
					"Implementaci贸n completa del algoritmo DDA (Digital Differential Analysis) para calcular distancias a paredes con precisi贸n",
					"Correcci贸n de la distorsi贸n de perspectiva (fish-eye) mediante transformaciones matem谩ticas",
					"Renderizado optimizado para mantener un rendimiento fluido incluso en mapas complejos y gesti贸n eficiente de memoria con estructuras de datos minimalistas conforme a las normas de 42"
				]
			},
			{
				"name": "Renderizado 3D",
				"lines": [
					"Sistema de texturas para paredes con mapeo preciso seg煤n punto de impacto del rayo",
					"Efectos de iluminaci贸n din谩mica con sombreado seg煤n distancia y orientaci贸n de las paredes"
				]
			}
		],
		"tags": ["C", "Algoritmia", "Design tools"]
	},
	{
		"git": "https://github.com/nachopuerto95/cpp",
		"images": ["/images/low2_cpp/low2_01.png"],
		"title": "C++ Piscine",
		"description": "Un conjunto de proyectos de CPP (cada uno consta de 3 a 5 ejercicios) en los que se exploran los fundamentos y conceptos avanzados de la Programaci贸n Orientada a Objetos (POO). El aprendizaje se estructura en dos bloques progresivos: el primero se centra en las bases de la POO y el segundo profundiza en plantillas, gesti贸n de memoria y la Standard Template Library (STL).",
		"caracteristicas": [
			{	
				"name": "M贸dulos 00-04: Fundamentos de C++ y POO",
				"lines": [
					"Transici贸n de C a C++, introduciendo conceptos como clases, constructores, destructores y el puntero 'this'.",
					"Gesti贸n de memoria din谩mica con 'new' y 'delete', polimorfismo (sobrecarga de operadores y funciones) y la forma can贸nica de Coplien.",
					"Implementaci贸n de herencia y polimorfismo de subtipo a trav茅s de funciones virtuales y clases abstractas para construir jerarqu铆as de clases flexibles."
				]
			},
			{
				"name": "M贸dulos 05-09: C++ Avanzado y STL",
				"lines": [
					"Manejo robusto de errores mediante el sistema de excepciones (try, catch, throw).",
					"Introducci贸n a la programaci贸n gen茅rica con plantillas (templates) para crear c贸digo reutilizable y adaptable a diferentes tipos de datos.",
					"Dominio de la Standard Template Library (STL), incluyendo el uso de contenedores (vector, map, list), iteradores y algoritmos para resolver problemas complejos de manera eficiente."
				]
			}
		],
		"tags": ["C++", "POO", "C"]
	},
	{
		"git": "https://github.com/jpuerto-loruzqui/42Miinishell",
		"images": ["/images/low3_mini/low3_01.png", "/images/low3_mini/low3_02.png"],
		"title": "Minishell - Tu propio int茅rprete",
		"description": "Desarrollo de una r茅plica funcional de un int茅rprete de comandos de UNIX como bash. El proyecto consiste en parsear y ejecutar comandos introducidos por el usuario, gestionar procesos, redirecciones, pipes y se帽ales, as铆 como implementar comandos internos (built-ins).",
		"caracteristicas": [
			{
				"name": "Parsing y Ejecuci贸n de Comandos",
				"lines": [
					"An谩lisis de la entrada del usuario para interpretar comandos, argumentos, pipes y redirecciones.",
					"Gesti贸n de variables de entorno, comillas y caracteres especiales para un comportamiento similar a shells est谩ndar."
				]
			},
			{
				"name": "Gesti贸n de Procesos y Flujos",
				"lines": [
					"Uso de 'fork', 'execve' y 'wait' para crear y gestionar procesos hijos que ejecutan comandos externos.",
					"Implementaci贸n de tuber铆as (|) para comunicar la salida de un proceso con la entrada de otro, y redirecciones de entrada/salida (<, >, <<, >>)."
				]
			},
			{
				"name": "Built-ins y Se帽ales",
				"lines": [
					"Manejo de se帽ales como Ctrl-C (SIGINT) y Ctrl-\\ (SIGQUIT) para una interacci贸n robusta con el usuario.",
					"Creaci贸n de comandos internos como 'echo', 'cd', 'pwd', 'export', 'unset', 'env' y 'exit' que se ejecutan directamente en el shell."
				]
			}
		],
		"tags": ["C", "Unix", "Shell", "Procesos", "Se帽ales"]
	},
	{
		"git": "https://github.com/Nachopuerto95/inception",
		"images": ["/images/low4_inc/low4_01.png"],
		"title": "Inception - Docker compose para 42",
		"description": "Proyecto de administraci贸n de sistemas y virtualizaci贸n que consiste en desplegar una infraestructura de m煤ltiples servicios utilizando Docker. Se debe orquestar un conjunto de contenedores (Nginx, WordPress, MariaDB) para que funcionen como una aplicaci贸n web completa y segura.",
		"caracteristicas": [
			{
				"name": "Contenedorizaci贸n con Docker",
				"lines": [
					"Creaci贸n de im谩genes personalizadas para cada servicio (Nginx, WordPress, MariaDB) a trav茅s de Dockerfiles.",
					"Configuraci贸n de redes y vol煤menes para garantizar la comunicaci贸n entre contenedores y la persistencia de los datos.",
					"Como parte del bonus implement茅 Adminer para consultar la Database, y FTP para transferir archivos entre m谩quinas, adem谩s de una p谩gina est谩tica (Yo realic茅 este portfolio para esa secci贸n)"
				]
			},
			{
				"name": "Orquestaci贸n y Despliegue",
				"lines": [
					"Uso de docker-compose para definir, configurar y gestionar el ciclo de vida de la aplicaci贸n multi-contenedor.",
					"Implementaci贸n de un servidor web Nginx con configuraci贸n TLS/SSL para asegurar las comunicaciones."
				]
			},
			{
				"name": "Administraci贸n de Servicios",
				"lines": [
					"Despliegue de una base de datos MariaDB y un gestor de contenidos WordPress, asegurando su correcta interconexi贸n.",
					"Configuraci贸n avanzada de servicios, incluyendo la gesti贸n de variables de entorno y secretos para la configuraci贸n."
				]
			}
		],
		"tags": ["Docker", "Docker-Compose", "Nginx", "WordPress", "Shell", "React", "JSON", "FTP", "Mysql" ]
	},
	{
		"git": "https://github.com/Nachopuerto95/philosophers",
		"images": ["/images/low5_phil/low5_01.png", "/images/low5_phil/low5_02.png"],
		"title": "Philosophers",
		"description": "Resoluci贸n del cl谩sico problema de concurrencia de los fil贸sofos cenando. El objetivo es simular un escenario donde varios fil贸sofos deben compartir recursos (tenedores) sin caer en interbloqueos (deadlocks) ni inanici贸n, aprendiendo los fundamentos de la programaci贸n multihilo y la sincronizaci贸n.",
		"caracteristicas": [
			{
				"name": "Programaci贸n Multihilo",
				"lines": [
					"Creaci贸n y gesti贸n de m煤ltiples hilos (pthreads), donde cada hilo representa a un fil贸sofo.",
					"Sincronizaci贸n del ciclo de vida de los fil贸sofos (comer, dormir, pensar) para que se ejecuten de manera concurrente."
				]
			},
			{
				"name": "Sincronizaci贸n y Mutex",
				"lines": [
					"Uso de mutex (cerrojos de exclusi贸n mutua) para proteger los recursos compartidos (tenedores) y evitar condiciones de carrera.",
					"Implementaci贸n de un algoritmo que previene deadlocks, asegurando que el sistema pueda progresar indefinidamente."
				]
			},
			{
				"name": "Monitorizaci贸n y Precisi贸n",
				"lines": [
					"Medici贸n precisa del tiempo para controlar las acciones de los fil贸sofos y detectar si alguno muere de hambre.",
					"Desarrollo de un sistema de logs que muestra el estado de cada fil贸sofo en tiempo real sin interferir con la simulaci贸n."
				]
			}
		],
		"tags": ["C", "Multithreading", "Concurrencia", "Mutex", "Pthreads"]
	},
	{
	"git": "https://github.com/Nachopuerto95/push_swap",
	"images": ["/images/low6_pusw/low6_01.gif"],
	"title": "Push Swap",
	"description": "Un proyecto de algoritmia que consiste en ordenar una pila de n煤meros utilizando un conjunto limitado de operaciones y dos pilas (A y B). El desaf铆o es encontrar la secuencia de instrucciones m谩s corta posible para ordenar los n煤meros, optimizando la eficiencia del algoritmo.",
	"caracteristicas": [
		{
		"name": "Manipulaci贸n de Pilas (Stacks)",
		"lines": [
			"Implementaci贸n de las operaciones permitidas: swap (sa, sb, ss), push (pa, pb), y rotate (ra, rb, rr, rra, rrb, rrr).",
			"Dise帽o de estructuras de datos (listas enlazadas) para representar y manipular eficientemente las dos pilas."
		]
		},
		{
		"name": "Algoritmo de Ordenaci贸n",
		"lines": [
			"Desarrollo de un algoritmo eficiente para ordenar los n煤meros minimizando el n煤mero de movimientos.",
			"Estrategia de 'divide y vencer谩s', moviendo los n煤meros de la pila A a la B de manera ordenada para luego devolverlos."
		]
		},
		{
		"name": "Optimizaci贸n y Eficiencia",
		"lines": [
			"Implementaci贸n de algoritmos como 'Turk Algorithm' o variantes para optimizar la selecci贸n de movimientos.",
			"Creaci贸n de un programa 'checker' que verifica si la secuencia de instrucciones generada ordena correctamente la pila."
		]
		}
	],
	"tags": ["C", "Algoritmia", "Estructura de Datos", "Optimizaci贸n"]
	}
]